{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "directionality": "bidi",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-DISEASE",
    "2": "B-GENE",
    "3": "B-PROTEIN",
    "4": "B-ENZYME",
    "5": "B-VAR",
    "6": "B-MPA",
    "7": "B-INTERACTION",
    "8": "B-PATHWAY",
    "9": "B-CPA",
    "10": "B-REG",
    "11": "B-POSREG",
    "12": "B-NEGREG",
    "13": "I-DISEASE",
    "14": "I-GENE",
    "15": "I-PROTEIN",
    "16": "I-ENZYME",
    "17": "I-VAR",
    "18": "I-MPA",
    "19": "I-INTERACTION",
    "20": "I-PATHWAY",
    "21": "I-CPA",
    "22": "I-REG",
    "23": "I-POSREG",
    "24": "I-NEGREG",
    "25": "E-DISEASE",
    "26": "E-GENE",
    "27": "E-PROTEIN",
    "28": "E-ENZYME",
    "29": "E-VAR",
    "30": "E-MPA",
    "31": "E-INTERACTION",
    "32": "E-PATHWAY",
    "33": "E-CPA",
    "34": "E-REG",
    "35": "E-POSREG",
    "36": "E-NEGREG",
    "37": "S-DISEASE",
    "38": "S-GENE",
    "39": "S-PROTEIN",
    "40": "S-ENZYME",
    "41": "S-VAR",
    "42": "S-MPA",
    "43": "S-INTERACTION",
    "44": "S-PATHWAY",
    "45": "S-CPA",
    "46": "S-REG",
    "47": "S-POSREG",
    "48": "S-NEGREG"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CARDINAL": 1,
    "B-DATE": 2,
    "B-EVENT": 3,
    "B-FAC": 4,
    "B-GPE": 5,
    "B-LANGUAGE": 6,
    "B-LAW": 7,
    "B-LOC": 8,
    "B-MONEY": 9,
    "B-NORP": 10,
    "B-ORDINAL": 11,
    "B-ORG": 12,
    "B-PERCENT": 13,
    "B-PERSON": 14,
    "B-PRODUCT": 15,
    "B-QUANTITY": 16,
    "B-TIME": 17,
    "B-WORK_OF_ART": 18,
    "E-CARDINAL": 37,
    "E-DATE": 38,
    "E-EVENT": 39,
    "E-FAC": 40,
    "E-GPE": 41,
    "E-LANGUAGE": 42,
    "E-LAW": 43,
    "E-LOC": 44,
    "E-MONEY": 45,
    "E-NORP": 46,
    "E-ORDINAL": 47,
    "E-ORG": 48,
    "E-PERCENT": 49,
    "E-PERSON": 50,
    "E-PRODUCT": 51,
    "E-QUANTITY": 52,
    "E-TIME": 53,
    "E-WORK_OF_ART": 54,
    "I-CARDINAL": 19,
    "I-DATE": 20,
    "I-EVENT": 21,
    "I-FAC": 22,
    "I-GPE": 23,
    "I-LANGUAGE": 24,
    "I-LAW": 25,
    "I-LOC": 26,
    "I-MONEY": 27,
    "I-NORP": 28,
    "I-ORDINAL": 29,
    "I-ORG": 30,
    "I-PERCENT": 31,
    "I-PERSON": 32,
    "I-PRODUCT": 33,
    "I-QUANTITY": 34,
    "I-TIME": 35,
    "I-WORK_OF_ART": 36,
    "O": 0,
    "S-CARDINAL": 55,
    "S-DATE": 56,
    "S-EVENT": 57,
    "S-FAC": 58,
    "S-GPE": 59,
    "S-LANGUAGE": 60,
    "S-LAW": 61,
    "S-LOC": 62,
    "S-MONEY": 63,
    "S-NORP": 64,
    "S-ORDINAL": 65,
    "S-ORG": 66,
    "S-PERCENT": 67,
    "S-PERSON": 68,
    "S-PRODUCT": 69,
    "S-QUANTITY": 70,
    "S-TIME": 71,
    "S-WORK_OF_ART": 72
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "tokenizer_class": "BertTokenizerFast",
  "type_vocab_size": 2,
  "vocab_size": 21128
}
